/* Функция для проверки длины строки. Она принимает строку, которую нужно проверить, и максимальную длину и возвращает true,
 если строка меньше или равна указанной длине, и false, если строка длиннее.
 Эта функция нам пригодится для валидации формы. Примеры использования функции:

// Cтрока короче 20 символов
имяФункции('проверяемая строка', 20); // true
// Длина строки ровно 18 символов
имяФункции('проверяемая строка', 18); // true
// Строка длиннее 10 символов
имяФункции('проверяемая строка', 10); // false*/

function Fr (str,num){
  let s =str.length;
  if(s > num){return true;}
  return false;
}


console.log('1. Ожидаю "false", получаю - ', Fr('Привет,как дела?', 17));
console.log('1. Ожидаю "false", получаю - ', Fr('Привет, как дела ?', 20));
console.log('1. Ожидаю "true", получаю - ', Fr('Привет, Джон', 10));
console.log('1. Ожидаю "true", получаю - ', Fr('Привет,как дела?', 15));


function P (str){
  const lower = str.toLowerCase();
  const l = lower.replaceAll(" ", "");
  let s = l.length;
  let r='';
  for (let i =s-1; i>=0 ;i--){
    r+=l[i];
  }
  if (l === r){return true;}
  return false;
}
console.log('1. Ожидаю "true", получаю - ', P('топот'));
console.log('1. Ожидаю "true", получаю - ', P('ДовОд'));
console.log('1. Ожидаю "false", получаю - ', P('Кекс'));
console.log('1. Ожидаю "true", получаю - ', P('Лёша на полке клопа нашёл '));

function N (num){
  let h='';
  for (const ch of String(num)){
    if (ch >= '0' && ch <'9' ){
      h+=ch;
    }
  }
  if (h ===' '){
    return NaN;
  }
  return Number(h);
}

console.log('1. Ожидаю "25", получаю - ', N(25));
console.log('1. Ожидаю "25", получаю - ', N('25 год'));
console.log('1. Ожидаю "2022", получаю - ', N('ECMAScript 2022'));
console.log('1. Ожидаю "105", получаю - ', N('1 кефир, 0.5 батона'));
console.log('1. Ожидаю "7", получаю - ', N('агент 007'));
console.log('1. Ожидаю "NaN", получаю - ', N('а я томат'));
